Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: ; Get a raw pointer to the document object of the top-most IE window.
ja: ;最上位のIEウィンドウのドキュメントオブジェクトへの生ポインタを取得する。

source: ; Get first matching process.
ja: ; 最初のマッチング処理を取得する。

source: ; Get the base object for all instances of TaskbarList.
ja: ; TaskbarList のすべてのインスタンスのベースオブジェクトを取得する。

source: ; Get the bounds of each dimension:
ja: ; 各次元の境界を取得する。

source: ; Get the number of dimensions:
ja: ; 次元数を取得する。

source: ; HKEY_LOCAL_MACHINE and HKEY_CURRENT_USER, so searching all three isn't necessary.
ja: ; HKEY_LOCAL_MACHINE と HKEY_CURRENT_USER の3つを検索する必要がありません。

source: ; Have an "Enter" keystroke open the selected reminder rather than snoozing it.
ja: ; Enterキーを押すと、選択したリマインダーをスヌーズするのではなく、開くようにします。

source: ; Hexadecimal
ja: ; 16進数

source: ; Hide the drop-down list.
ja: ; ドロップダウンリストを非表示にする。

source: ; Hold down right-control then press right-shift repeatedly to move forward.
ja: ; 右コンを押しながら、右シフトを繰り返し押して前進します。

source: ; Hold down the left mouse button.
ja: ; マウスの左ボタンを押したままにします。

source: ; However, you can use its tray icon to open the script in an editor, or to
ja: ; ただし、トレイアイコンを使って、スクリプトをエディタで開いたり、

source: ; HrInit itself has no parameters, so bind only the index,
ja: ; HrInit自身はパラメータを持たないので、インデックスだけをバインドします。

source: ; IE not found.
ja: ; IEが見つかりません。

source: ; IE passes url as a reference to a VARIANT, therefore &url is used above
ja: ; IEはurlをVARIANTへの参照として渡すため、上記では&urlが使用されています。

source: ; IUnknown interface pointer
ja: ; IUnknown インターフェースポインタ

source: ; If a VARIANT contains a string or object, it must be explicitly freed
ja: ; VARIANTが文字列やオブジェクトを含む場合は、明示的に解放する必要があります。

source: ; If the URL ends in a double quote, remove it.
ja: ; URLの末尾がダブルクォートで終わっている場合は、それを削除する。

source: ; If the keys are swapped, Alt must be pressed first (use one at a time):
ja: ; キーが入れ替わっている場合は、Altを先に押す必要があります（一度に1つずつ使用します）。

source: ; If you're going to wait, there's no need for onreadystatechange.
ja: ; 待つのであれば、onreadystatechangeは必要ない。

source: ; In case previous run was terminated prematurely.
ja: ; 前回実行したプログラムが途中で終了してしまった場合。

source: ; In that case, retract it:
ja: ; その場合は撤回してください：

source: ; In the following example, if the DLL isn't yet loaded, use LoadLibrary in place of GetModuleHandle.
ja: ; 次の例では、DLLがまだロードされていない場合、GetModuleHandleの代わりにLoadLibraryを使用してください。

source: ; In this case, FileRead returns a Buffer.
ja: ; この場合、FileReadはBufferを返します。

source: ; In this case, the blank parameter is 'this' (normally hidden).
ja: ; この場合、空白のパラメータは'this'（通常は非表示）です。

source: ; Incorrect: Parameters are mismatched.
ja: ; 不正解です。パラメータが不一致です。

source: ; Indicates that the alt-tab menu is present on the screen.
ja: ; alt-tab メニューが画面上に存在することを示す。

source: ; It will look like 9/1/2005 3:53 PM
ja: ; 2005年9月1日 3:53 PM

source: ; It's also a method.
ja: ; メソッドでもあります。

source: ; Leave a parameter blank to let the caller provide a value.
ja: ; パラメータを空白にすることで、呼び出し側が値を指定できるようにします。

source: ; Local variables must be declared in this mode, otherwise they would be assumed global.
ja: ; ローカル変数はこのモードで宣言する必要があります。そうしないとグローバル変数とみなされます。

source: ; LogFileName was previously given a value somewhere outside this function.
ja: ; LogFileNameは、以前この関数の外のどこかで値を与えられていました。

source: ; Looks like an executable file...
ja: ; 実行ファイルのように見えるが...。

source: ; M3 = Multiselect existing files.
ja: ; M3 = 既存ファイルをマルチセレクトする。

source: ; Maintain a tally locally (its value is remembered between calls).
ja: ; 現地でタリーを維持する（その価値はコール間で記憶される）。

source: ; Make a buffer big enough for a VARIANT.
ja: ; VARIANTのために十分な大きさのバッファを作成する。

source: ; Make a reference to a VARIANT.
ja: ; VARIANTへの参照を行う。

source: ; Make all hotstrings below this point case insensitive.
ja: ; これより下のホットストリングはすべて大文字小文字を区別しないようにする。

source: ; Make all pixels of this color transparent and make the text itself translucent (150):
ja: ; この色のすべてのピクセルを透明にし、テキスト自体を半透明にする（150）：

source: ; Make left-control a prefix by using it in front of "&" at least once.
ja: ; 少なくとも1回は"&"の前に使うことで、left-controlを接頭辞とする。

source: ; Make the release of Numpad0 produce a Numpad0 keystroke. See comment below.
ja: ; Numpad0 のリリースでNumpad0 のキーストロークを生成させる。以下のコメント参照。

source: ; Make the active window the Last Found Window
ja: ; アクティブウィンドウをLast Found Windowにする。

source: ; Maximize the active/foreground window.
ja: ; アクティブ／フォアグラウンドウィンドウを最大化する。

source: ; May improve reliability and reduce side effects.
ja: ; 信頼性を向上させ、副作用を低減させることができる。

source: ; Method #1
ja: ; 方法 #1

source: ; Method #2: Relies on the fact that AutoHotkey natively uses signed 64-bit integers.
ja: ; 方法 #2：AutoHotkeyがネイティブに符号付き64ビット整数を使用することに依存します。

source: ; Missing elements are preserved:
ja: ; 欠けている要素はそのままです。

source: ; Move the OK button to the left and increase its width.
ja: ; OKボタンを左側に移動し、幅を広げる。

source: ; Moves all files and folders matching SourcePattern into the folder named DestinationFolder and
ja: ; SourcePatternに一致するすべてのファイルとフォルダーをDestinationFolderというフォルダーに移動し

source: ; My Computer.
ja: ; マイコンピュータ。

source: ; Need extra text to avoid activation of a phantom window:
ja: ; ファントムウィンドウの起動を避けるため、テキストを追加する必要がある：

source: ; Neither the left nor right Control key is down.
ja: ; 左右のコントロールキーが押されていない。

source: ; Nested function:
ja: ; ネストされた機能：

source: ; No braces are required around the next line because it's only a single line.
ja: ; 次の行は1行なので、中括弧は不要です。

source: ; No focused control.
ja: ; フォーカスされたコントロールがない。

source: ; No value
ja: ; 値なし

source: ; Non-wrapped interface pointers must be manually freed.
ja: ; ラップされていないインターフェイスポインタは、手動で解放する必要があります。

source: ; Normal (single) variable reference => target
ja: ; 通常の（単一の）変数の参照⇒ターゲット

source: ; Not valid since arr2 == arr1[1], which has been destroyed:
ja: ; arr2 == arr1[1]が破壊されたので無効です。

source: ; Note that Z must still be optional in this case.
ja: ; この場合でも、Zはオプションでなければならないことに注意してください。

source: ; Nothing to search for, or a match was found.
ja: ; 検索するものがない、または一致するものが見つかった。

source: ; Now copy all the folders:
ja: ; 今度は、すべてのフォルダをコピーします：

source: ; Now move all the folders:
ja: ; 今度は、すべてのフォルダを移動します：

source: ; Now set the mouse to the slower speed specified in the next-to-last parameter (the range is 1-20, 10 is default):
ja: ; ここで、マウスの速度を、最後から2番目のパラメータで指定された遅い速度に設定します（範囲は1～20、10がデフォルト）：

source: ; Now that the file was written, read its contents back into memory.
ja: ; ファイルが書き込まれたので、その内容をメモリに読み返してください。

source: ; NumGet(ptr, "ptr") returns the address of the object's virtual function
ja: ; NumGet(ptr, "ptr") は、オブジェクトの仮想関数のアドレスを返します。

source: ; Old (uses obsolete v2.0-a rules for demonstration since v1 had no `is` or Error classes)
ja: ; Old (v1には `is` や Error クラスがないため、古い v2.0-a のルールを使ってデモを行う)

source: ; Older, or with classic alt-tab enabled
ja: ; オールド、またはクラシックなalt-tabを有効にした場合。

source: ; Only RootDir is present.
ja: ; RootDirのみ存在する。

source: ; Only RootDir is present, and it's relative to the current working directory.
ja: ; RootDirのみが存在し、現在の作業ディレクトリからの相対パスです。

source: ; Only Filename is present (but if "My File" exists as a folder, it is assumed to be RootDir).
ja: ; Filenameのみ存在する（ただし、"My File"がフォルダとして存在する場合は、RootDirとする）。

source: ; Open a command prompt at C:\
ja: ; コマンドプロンプトをC:\ に開きます。

source: ; Open a console window for this demonstration:
ja: ; このデモのためにコンソールウィンドウを開いてください：

source: ; Open a new Notepad window
ja: ; メモ帳の新規ウィンドウを開く

source: ; Open the Run dialog.
ja: ; 「ファイル名を指定して実行」ダイアログを開く。

source: ; Open the application's stdin/stdout streams.
ja: ; アプリケーションのstdin/stdoutストリームをオープンします。

source: ; Open the file for reading rather than writing.
ja: ; 書き込みではなく、読み込みのためにファイルを開く。

source: ; Open the file for writing rather than reading.
ja: ; 読み出しではなく、書き込みのためにファイルを開く。

source: ; Open the user's Documents folder.
ja: ; ユーザーのDocumentsフォルダを開く。

source: ; Option 1: Delete any existing file and then use FileAppend.
ja: ; オプション1：既存のファイルを削除し、FileAppendを使用します。

source: ; Option 2: Use FileOpen in overwrite mode and File.RawWrite.
ja: ; オプション2：FileOpenを上書きモードで使用し、File.RawWriteを使用します。

source: ; Or just StrGet(bufW).
ja: ; あるいは、StrGet(bufW)だけです。

source: ; Otherwise (since above didn't return), pass all unhandled events to the original WindowProc.
ja: ; そうでない場合は（上記が返らなかったので）、処理されなかったすべてのイベントを元のWindowProcに渡します。

source: ; Otherwise the above set the "last found" window for us:
ja: ; それ以外の場合は、"last found "ウィンドウを設定します。

source: ; Otherwise, continue.
ja: ; それ以外の場合は、続行します。

source: ; Otherwise:
ja: ; それ以外の場合。

source: ; Padding with spaces
ja: ; スペースでパディングする

source: ; Parameter list size must be specified for 32-bit.
ja: ; パラメータリストのサイズは32ビットで指定する必要があります。

source: ; Parentheses can be omitted if used at the start of a line.
ja: ; 行頭で使用する場合は、括弧を省略することができます。

source: ; Pass buffer to function.
ja: ; バッファを関数に渡す。

source: ; Pass control to EnumWindows(), which calls the callback repeatedly:
ja: ; コールバックを繰り返し呼び出すEnumWindows()に制御を渡す。

source: ; Pass it a timestamp (local, not UTC).
ja: ; タイムスタンプを渡す（UTCではなくローカル）。

source: ; Pass the VT_BYREF ComValue itself, no [] or .ref.
ja: ; VT_BYREF ComValueそのものを渡す。[] や .ref は使わない。

source: ; Pass zero to get the desktop's device context.
ja: ;デスクトップのデバイスコンテキストを取得する場合は、0を渡す。

source: ; Pause.
ja: ; ボーズ

source: ; Pointer to another type of value
ja: ; 別のタイプの値へのポインタ

source: ; Preamble - ScriptControl requires a 32-bit version of AutoHotkey.
ja: ; 前文 - ScriptControlはAutoHotkeyの32ビット版を必要とします。

source: ; Press AppsKey and Alt in any order, then slash (/).
ja: ; AppsKey と Alt を任意の順番で押して、スラッシュ（/）を押します。

source: ; Press Ctrl+Alt+P to pause. Press it again to resume.
ja: ; Ctrl+Alt+P を押すと一時停止します。もう一度押すと再開します。

source: ; Press Win-N to run Notepad.
ja: ; Win-Nを押してメモ帳を起動します。

source: ; Press Win-W to run Wordpad.
ja: ; Win-Wを押してWordpadを実行します。

source: ; Pressing ScrollLock will trigger this hotkey even when modifier key(s) are down.
ja: ; 修飾キーが押されていても、ScrollLockを押すとこのホットキーが起動します。

source: ; Prevents the status bar from showing a mouse-hover link instead of "Done".
ja: ; ステータスバーに "Done "の代わりにマウスホバーリンクが表示されないようにします。

source: ; Print a UTF-16 string into the buffer with wsprintfW().
ja: ; wsprintfW()でUTF-16文字列をバッファに出力する。

source: ; Print an ANSI string into the buffer with wsprintfA().
ja: ; wsprintfA()でANSI文字列をバッファに出力する。

source: ; Query for the WebBrowserApp service. In this particular case,
ja: ; WebBrowserApp サービスの ;クエリです。この特殊なケースで

source: ; Read machine type from COFF file header.
ja: ; COFF ファイルのヘッダーからマシンタイプを読み込む。

source: ; Release the Alt key, which activates the selected window.
ja: ; Altキーを離すと、選択したウィンドウがアクティブになります。

source: ; Release the first reference
ja: ; 最初のリファレンスを公開します。

source: ; Release the mouse button.
ja: ; マウスボタンを離す。

source: ; Release the second reference; object is deleted
ja: ; 2番目の参照を解除し、オブジェクトを削除する。

source: ; Reload when requested or at first call.
ja: ; リクエスト時またはファーストコール時にリロードします。

source: ; Reload.
ja: ; リロード

source: ; Remap CapsLock to LCtrl in a way compatible with IME.
ja: ; IMEと互換性のある方法で、CapsLockをLCtrlにリマップする。

source: ; Remove F_OWNVALUE.
ja: ; F_OWNVALUEを削除する。

source: ; Removes the trailing backslash, if present.
ja: ; もしあれば，末尾のバックスラッシュを削除する。

source: ; Replace 159 with the value discovered above. Replace FF (if needed) with the
ja: ; 159を上記で発見された値で置き換えてください。FFを(必要であれば)以下の値で置き換える。

source: ; Replace 159 with your key's value.
ja: ; 159をキーの値で置き換える。

source: ; Report each problem folder by name.
ja: ; 各問題フォルダを名前で報告する。

source: ; Reports #n
ja: ; レポート #n

source: ; Reports :X:btw
ja: ; レポート :X:btw

source: ; Reports sc1D
ja: ; sc1Dを報告。

source: ; Reports vk1B
ja: ; vk1Bの報告。

source: ; Request initialization via ITaskbarList.
ja: ; ITaskbarList を介したリクエスト初期化。

source: ; Request the object's IProvideClassInfo interface.
ja: ;オブジェクトの IProvideClassInfo インタフェースを要求する。

source: ; Requires the Cdecl calling convention.
ja: ; Cdecl の呼び出し規約を必要とする。

source: ; Reset in preparation for the next press of this hotkey.
ja: ; 次にこのホットキーを押すときに備えて、リセットを行います。

source: ; Restore previous clipboard content
ja: ; 以前のクリップボードの内容を復元する

source: ; Restore the original clipboard. Note the use of A_Clipboard (not ClipboardAll).
ja: ; 元のクリップボードを復元する。ClipboardAllではなく、A_Clipboardを使用していることに注意してください。

source: ; Restore the original speed.
ja: ; 元の速度に戻す。

source: ; Retrieve ANSI string from buffer.
ja: ; バッファからANSI文字列を取得する。

source: ; Retrieve the current speed so that it can be restored later:
ja: ; 現在の速度を取得し、後で復元できるようにする：

source: ; Retrieve the string from bufA (converted to the native format), and show it.
ja: ; bufA から文字列を取得し(ネイティブ形式に変換)、表示する。

source: ; Retrieve the string from bufW and show it.
ja: ; bufW から文字列を取り出し、表示する。

source: ; Return the HBRUSH to notify the OS that we altered the HDC.
ja: ; HDCを変更したことをOSに通知するため、HBRUSHを返す。

source: ; Return the WebBrowser object as IDispatch for usability.
ja: ; WebBrowserオブジェクトをIDispatchとして返し、使い勝手を良くする。

source: ; Return the closure.
ja: ; クロージャーを返り値とする。

source: ; Return value must be set to "Ptr" or "UPtr" vs. "Int".
ja: ; 戻り値は "Ptr "または "UPtr "対 "Int "に設定する必要があります。

source: ; Returning from a hotkey function ends the thread. Any underlying thread to be resumed is noncritical by definition.
ja: ; ホットキー機能から戻ると、そのスレッドが終了します。再開される基礎となるスレッドは、定義上、非クリティカルなものである。

source: ; Round to nearest minute to ensure accuracy.
ja: ; 正確を期すため、分単位に丸めて表示します。

source: ; Run command prompt.
ja: ; コマンドプロンプトを実行します。

source: ; Run query to retrieve matching process(es).
ja: ; クエリーを実行し、一致するプロセスを取得する。

source: ; Save all clipboard content
ja: ; クリップボードの内容をすべて保存する

source: ; Save the current file in Notepad.
ja: ; 現在のファイルをメモ帳に保存する。

source: ; Save the entire clipboard to a variable of your choice.
ja: ; クリップボード全体を任意の変数に保存します。

source: ; Save this for use in the second loop, below.
ja: ; 以下、2つ目のループで使用するために保存します。

source: ; Says hello after 1 second.
ja: ; 1秒後に"hello"を表示します。

source: ; Scroll left.
ja: ; 左にスクロールします。

source: ; Scroll right.
ja: ; 右にスクロールします。

source: ; Seconds is more accurate due to rounding issue.
ja: ; 四捨五入の関係で、「秒」の方が正確です。

source: ; See DirMove for description of mode 2 vs. 1.
ja: ; モード 2 とモード 1 の比較については、DirMoveを参照してください。

source: ; See Send {vkXXscYYY} for more details.
ja: ; 詳しくは Send {vkXXscYYY} をご覧ください。

source: ; Select all listbox items. 0x0185 is LB_SETSEL.
ja: ; リストボックスの全項目を選択する。0x0185はLB_SETSELです。

source: ; Send directly to the command prompt window.
ja: ; コマンドプロンプトのウィンドウに直接送信します。

source: ; Send the text to the inactive Notepad edit control.
ja: ; 非アクティブなメモ帳エディットコントロールにテキストを送信する。

source: ; Set capacity to hold four 4-byte integers.
ja: ; 4バイトの整数を4つ保持する容量を設定する。

source: ; Set focus to the OK button
ja: ; OKボタンにフォーカスを合わせる

source: ; Set the Last Found Window to the active window
ja: ; Last Found Windowをアクティブウィンドウに設定する。

source: ; SetTimer t, 0 ; Capturing t would create a circular reference.
ja: ; SetTimer t, 0 ; Capturing tは循環参照を作ることになる。

source: ; Sets the system clock to the specified date and time.
ja: ; システムクロックを指定した日付と時刻に設定する。

source: ; Setting async=true and waiting like this allows the script to remain
ja: ; async=trueを設定し、このように待機することで、スクリプトが残ります。

source: ; Show File/Internet Explorer windows/tabs.
ja: ; ファイル/Internet Explorerのウィンドウ/タブを表示する。

source: ; Show the drop-down list. The second parameter is omitted so that the last found window is used.
ja: ; ドロップダウンリストを表示します。第2パラメータは省略され、最後に見つかったウィンドウが使用されます。

source: ; Show the menu at the provided coordinates, X and Y. These should be used
ja: ; 指定された座標XとYにメニューを表示します。

source: ; Show the result.
ja: ; 結果を表示する。

source: ; Shows A, then B, then C.
ja: ; Aを表示し、次にBを表示し、次にCを表示します。

source: ; Shows Escape
ja: ; エスケープを表示する。

source: ; Shows also Escape
ja: ; エスケープを同様に表示する。

source: ; Signal that thread's loop to stop.
ja: ; そのスレッドのループを停止させる信号を送る。

source: ; Signed machine int
ja: ; 符号付きマシン整数

source: ; Simple substitution
ja: ; 簡単な置換

source: ; Simple usage:
ja: ; シンプルな使い方です。

source: ; Since the last parameter is omitted, the long date and time are retrieved.
ja: ; 最後のパラメータが省略されているため、長い日付と時刻が取得されます。

source: ; Start a command prompt (almost always cmd.exe).
ja: ; コマンドプロンプト（ほとんどの場合cmd.exe）を起動します。

source: ; Start off empty to allow ClipWait to detect when the text has arrived.
ja: ; テキストが到着したことをClipWaitが検出できるように、空でスタートします。

source: ; Store the variant type for VariantClear (if not VT_VARIANT).
ja: ; VariantClear のバリアントタイプを格納します（VT_VARIANT でない場合）。

source: ; Supports SciTE and Notepad++.
ja: ; SciTEとNotepad++をサポートします。

source: ; Suspend.
ja: ; サスペンド

source: ; Takes 2 parameters, including 'this'.
ja: ; 'this'を含む2つのパラメータを取る。

source: ; Tell EnumWindows() to continue until all windows have been enumerated.
ja: ; EnumWindows() に、すべてのウィンドウが列挙されるまで続けるように指示する。

source: ; Terminate this function as well as the calling function.
ja: ; 呼び出した関数と同様に、この関数も終了させる。

source: ; Test hotkey:
ja: ; ホットキーのテスト。

source: ; The "reminders" window in Outlook.
ja: ; Outlookの "リマインダー "ウィンドウ。

source: ; The * prefix allows it to fire whether or not Alt is held down.
ja: ; Altが押されていても押されていなくても発射されるように、*の接頭辞を付けています。

source: ; The above expression could be used directly in place of "colours" below:
ja: ; 上記の表現は、以下の「colors」の代わりに直接使用することができます：

source: ; The answer will be 366 since 2004 is a leap year.
ja: ; 2004年はうるう年なので、答えは366となります。

source: ; The file extension does not matter.
ja: ; ファイル拡張子は問いません。

source: ; The key has been released, so break out of the loop.
ja: ; キーが解除されたので、ループを解除してください。

source: ; The keyboard hook must be installed.
ja: ; キーボードフックの取り付けが必要です。

source: ; The next four lines are the action you want to repeat (update them to suit your preferences):
ja: ; 次の4行は、繰り返したい動作です（お好みで更新してください）。

source: ; The number 5 will be stored in Var.
ja: ; Varに数字5が格納されます。

source: ; The same is done for any other characters that might otherwise
ja: ; 他の文字も同様です。

source: ; The same thing again, but more direct:
ja: ; 同じことをもう一度、よりダイレクトに。

source: ; The simplest way when the method accepts VT_BYREF|VT_VARIANT:
ja: ; メソッドがVT_BYREF|VT_VARIANTを受け入れる場合、最も簡単な方法です。

source: ; The third parameter is omitted so the last found window is used.
ja: ; 第3パラメータが省略されているため、最後に見つかったウィンドウが使用されます。

source: ; The user didn't pick a file.
ja: ; ユーザーがファイルを選択しなかった。

source: ; The user signaled the loop to stop by pressing Win-Z again.
ja: ; 再びWin-Zを押すことでループを止める合図をした。

source: ; The warning is displayed even if the function is never called.
ja: ; 関数が一度も呼び出されない場合でも警告は表示されます。

source: ; These braces are now required, otherwise else associates with while
ja: ; これらの中括弧は現在必須であり、そうでなければ else は while と関連付けられる。

source: ; This also sets the "last found window" for use with WinExist below.
ja: ; これは、以下のWinExistで使用するための"last found window"も設定します。

source: ; This and the next are whether other processes can open the file while we have it open.
ja: ; こちらがファイルを開いている間に、他のプロセスがファイルを開くことができるかどうかです。

source: ; This entire line is a comment.
ja: ; この行全体がコメントです。

source: ; This example also demonstrates one way to implement case conformity in a script.
ja: ; この例は、スクリプトで大文字と小文字の一致を実現する方法の1つも示しています。

source: ; This function fails when the minutes are odd
ja: ; 分数が奇数の場合、この機能は失敗します。

source: ; This function has a Finally block that acts as cleanup code
ja: ; この関数は、クリーンアップコードとして機能するFinallyブロックを備えています。

source: ; This hotkey can be triggered by both Numpad0 and LButton:
ja: ; このホットキーは、Numpad0とLButtonの両方でトリガーすることができます。

source: ; This hotstring replaces "]d" with the current date and time via the functions below.
ja: ; このホットストリングは、"]d "を以下の関数で現在の日付と時刻に置き換えます。

source: ; This is a comment on the same line as a function call.
ja: ;これは、関数呼び出しと同じ行にあるコメントです。

source: ; This is known to work incorrectly on IE7.
ja: ; IE7では正しく動作しないことが確認されています。

source: ; This is okay because t isn't captured above.
ja: ; これは、tが上で捕捉されていないので、大丈夫です。

source: ; This is the default value (milliseconds).
ja: ; 初期値（ミリ秒）です。

source: ; This line sends keystrokes to the active (foremost) window.
ja: ; この行は、アクティブ（最前面）ウィンドウにキーストロークを送信します。

source: ; This line takes effect regardless of the value of x.
ja: ; この行は、xの値に関係なく有効になります。

source: ; This means an underlying thread is already running the loop below.
ja: ; これは、下層のスレッドがすでに下のループを実行していることを意味します。

source: ; This mode indicates that the file to be opened must already exist.
ja: ; このモードは、オープンするファイルが既に存在することを示す。

source: ; This prevents keyboard auto-repeat from doing the DllCall repeatedly.
ja: ; キーボードのオートリピートがDllCallを繰り返し実行するのを防ぐことができます。

source: ; This prevents owned GUI windows (but not dialogs) from automatically minimizing:
ja: ; ダイアログ以外の所有するGUIウィンドウが自動的に最小化されないようにします。:

source: ; This prevents the main window from hiding on minimize:
ja: ; メインウィンドウを最小化したときに非表示にならないようにします。

source: ; This struct consists of 8 UShorts (i.e. 8*2=16).
ja: ; この構造体は8個のUShortで構成されています。

source: ; This will be a closure due to app_title and app_path.
ja: ; app_title と app_path の関係でクローズとなります。

source: ; This will be a closure due to f.
ja: ; これはfによる閉鎖となる。

source: ; This works only because IWebBrowserApp is derived from IDispatch.
ja: ; これは、IWebBrowserAppがIDispatchから派生したものであるためです。

source: ; Title is "Greeting"
ja: ; タイトルは "Greeting "です。

source: ; Title is A_ScriptName
ja: ; タイトルはA_ScriptName

source: ; To conserve memory, the DLL may be unloaded after using it.
ja: ; メモリ節約のため、使用後はDLLをアンロードすることがあります。

source: ; Try various milliseconds.
ja: ; 様々なミリ秒を試してみてください。

source: ; Turn off the tip.
ja: ;チップを切る。

source: ; Turn the hotkey off.
ja: ; ホットキーをオフにします。

source: ; Turn the same hotkey back on.
ja: ; 同じホットキーを再びオンにします。

source: ; Typed in all-caps.
ja: ; オールキャプスで入力。

source: ; Typed in any other combination.
ja: ; 他の組み合わせで入力した。

source: ; Typed with only the first letter upper-case.
ja: ; 最初の文字だけ大文字で入力した。

source: ; Unlike the method used above, this would not support more than 24 hours worth of seconds:
ja: ; 上記の方法とは異なり、24時間に相当する分以上の秒数をサポートすることはできません：

source: ; Unsigned machine int
ja: ; 符号なしマシン整数

source: ; Update this to reflect the script's name (case sensitive).
ja: ; スクリプトの名前（大文字と小文字が区別されます）を反映するように更新します。

source: ; Use AutoHotkey's main window to display monospaced text.
ja: ; AutoHotkeyのメインウィンドウで等幅テキストを表示させる。

source: ; Use SendEvent so that the script's own hotkeys can be triggered.
ja: ; スクリプト独自のホットキーがトリガーできるように、SendEventを使用します。

source: ; Use the window found above.
ja: ; 上記のウィンドウを使用します。

source: ; User-defined type -- NOT SUPPORTED
ja: ; ユーザー定義型 -- NOT SUPPORTED

source: ; Using the closure's original var is safe.
ja: ; クロージャーのオリジナル変数を使うのが無難です。

source: ; Wait a bit for Ctrl+V to be processed
ja: ; Ctrl+V が処理されるまで少し待つ。

source: ; Wait for it to appear.
ja: ; 表示されるのを待ちます。

source: ; Wait for the clipboard to contain text.
ja: ; クリップボードにテキストが入るのを待ちます。

source: ; Wait for the dialog to appear.
ja: ; ダイアログが表示されるのを待ちます。

source: ; Wait for the key to be released. Use one KeyWait for each of the hotkey's modifiers.
ja: ; キーが解除されるのを待ちます。 ホットキーのモディファイアごとに1つのKeyWaitを使用する。

source: ; Wheel over taskbar: increase/decrease volume.
ja: ; タスクバー上のホイール：音量の増加/減少。

source: ; When finished with the object, simply replace any references with
ja: ; オブジェクトを使い終わったら、すべての参照を

source: ; When the menu is cancelled, release the Alt key automatically.
ja: ; メニューがキャンセルされたときは、自動的にAltキーを離します。

source: ; When writing a file this way, use `r`n rather than `n to start a new line.
ja: ; この方法でファイルを書く場合、改行には `n ではなく `r`n を使用します。

source: ; Where ... means optional Control, WinTitle, etc.
ja: ; Where ...は、オプションのControl、WinTitleなどを意味します。

source: ; Where ... means optional WinTitle, etc.
ja: ; Where ...は、オプションのWinTitleなどを意味する。

source: ; Will yield something similar to C:\MYDOCU~1\ADDRES~1.txt
ja: ; C:¥MYDOCU~1ADDRES~1.txt のような結果になります。

source: ; Win+C hotkey to toggle the cursor on and off.
ja: ; Win+CホットキーでカーソルのON/OFFを切り替えられます。

source: ; Win+C, Shift+Win+C, Ctrl+Win+C, etc. will all trigger this hotkey.
ja: ; Win+C、Shift+Win+C、Ctrl+Win+Cなど、すべてこのホットキーがトリガーされます。

source: ; Win+N activates or launches Notepad.
ja: ; Win+Nでメモ帳を起動、または起動します。

source: ; Win+Space hotkey.
ja: ; Win+Space ホットキー。

source: ; Win+W activates or launches WordPad.
ja: ; Win+WでWordPadを起動、または起動します。

source: ; WinExist returns an HWND.
ja: ; WinExistはHWNDを返す。
